<script setup>
defineProps({
  lang: String,
});
</script>

<template>
  <div class="backgroundFrame">
    <div class="page pageFour">
      <h1>
        {{ lang === "kz" ? "Мұғалімдер мен ата-аналар" : "Педагоги и родители" }}
      </h1>
      <p>
        {{
          lang === "kz"
            ? `Көбінесе ата-аналар мен мұғалімдер қарама-қарсы жақ ретінде қабылданады. Бұл жағдай көп ресурстарды алады және басты нәрсеге — балаларды оқыту мен тәрбиелеуге назар аударуға мүмкіндік бермейді. Ата-аналар мен мұғалімдер конструктивті қарым-қатынасты қалай үйрене алады? Біз Балалық шақ, отбасы және білім беруді зерттеу институтының ұсыныстарымен бөлісеміз.`
            : `Нередко родители и учителя воспринимаются как противоборствующие стороны. Такая ситуация отнимает много ресурсов и не даёт сосредоточиться на главном — обучении и воспитании ребят. Как родителям и педагогам научиться конструктивному общению? Делимся рекомендациями от Института изучения детства, семьи и воспитания.`
        }}
      </p>
      <ul>
        <li>
          {{
            lang === "kz"
              ? `Қақтығыс болған жағдайда, шын мәнінде не болғанын анықтаңыз. 90% жағдайда мәселе қақтығыстың астында жатыр және жанжал бірінші тітіркендіргіш факторға реакция ретінде туындайды. Мысалы, баланың 2-сыныбы ата-анасының жұмыстағы шаршауымен байланысты болды. Оның үстіне жағдайды талқылағысы келген мұғалім дұрыс емес уақытта телефон соқты. Нәтижесінде конфликт проблемаға байланысты емес, сыртқы жағдайлардың фонында туындайды.`
              : `В случае конфликта выясните, что случилось на самом деле.В 90% случаев проблема лежит под поверхностью столкновения и конфликт возникает как реакция на первый раздражающий фактор. Например, двойка ребёнка наложилась на усталость родителей на работе. Да к тому же и учитель, которые захотел обсудить ситуацию, позвонил не вовремя. В результате конфликт возникает не в связи с проблемой, а на фоне внешних обстоятельств.`
          }}
        </li>
        <li>
          {{
            lang === "kz"
              ? `Екінші жақты тыңдап, түсінуге тырысыңыз. Өзіңізді басқа адамның орнына қою туралы кеңес мұнда бұрынғыдан да орынды. Бұл жағдайда оны не алаңдатады, оның мақсаты қандай? Сіздікінен соншалықты ерекшелене ме?`
              : `Постарайтесь услышать и понять другую сторону.Здесь как никогда уместен совет мысленно поставить себя на место другого человека. Что волнует его в сложившейся ситуации, какова его цель? Так ли сильно она отличается от вашей?`
          }}
        </li>
        <li>
          {{
            lang === "kz"
              ? `Мәселеге биікте ұшқан құстың көзімен қараңыз.Қақтығысты осы жерде және қазір шешу керек пе, әлде жағдайды «жібере» аласыз ба? Әдетте, ата-аналар мен мұғалімдердің түпкі мақсаты бір, және осыны есте сақтай отырып, жергілікті қайшылықтарды шешу оңайырақ.`
              : `Посмотрите на проблему с высоты птичьего полёта.Необходимо ли решать конфликт здесь и сейчас, или можно «отпустить» ситуацию? Как правило, конечная цель у родителей и учителей одна, и помня это, проще уладить локальные противоречия.`
          }}
        </li>
        <li>
          {{
            lang === "kz"
              ? `Әңгімелесушіге құрметпен қарау. Әңгімелесуші іскерлік қарым-қатынас сызығынан өтіп кеткен болса, мұны істеу әсіресе қиын болуы мүмкін. Бірақ егер екеуің де осы сызықтан асып кетсеңіз, конструктивті диалогқа оралу әлдеқайда қиын болады.`
              : `Сохраняйте уважение к собеседнику.Это бывает особенно трудно сделать, если собеседник уже перешёл границу делового общения. Но если вы оба перешагнёте эту черту, вернуться к конструктивному диалогу будет гораздо сложнее.`
          }}
        </li>
        <li>
          {{
            lang === "kz"
              ? `Мектеп әкімшілігін тартуға асықпаңыз, кейде бұл қажет болады. Бірақ, ең алдымен, ата-анамен жалғыз немесе баламен бірге сөйлесу маңызды. Сіз өз бетіңізше келіссөздер жүргізе аласыз.`
              : `Не спешите привлекать администрацию школы.Иногда это необходимо. Но в первую очередь важно побеседовать с родителями наедине или вместе с ребёнком. Возможно, вы сможете договориться самостоятельно.`
          }}
        </li>
        <li>
          {{
            lang === "kz"
              ? `Тыныштық қажет болса, үзіліс жасаңыз. Көбінесе эмоциялар бізге басқаларды естуге және өз ойымызды дұрыс тұжырымдауға кедергі жасайды. Бұл ата-аналарға да қатысты. Егер олардың шетте тұрғанын көрсеңіз, әңгімені кейінге қалдыруды ұсыныңыз. Мысалы, келесі фразаны пайдаланыңыз: «Мен сіздің бұл жағдайға ренжігеніңізді көріп тұрмын. Мен де. Біз не істеу керектігін ойлауымыз керек».`
              : `Возьмите паузу, если нужно успокоиться.Зачастую эмоции мешают нам услышать другого и правильно сформулировать собственные мысли. То же самое касается и родителей. Если вы видите, что они «на взводе», предложите отложить разговор. Например, используйте такую фразу: «Я вижу, вы расстроены этой ситуацией. Я тоже. Нам нужно подумать, что делать».`
          }}
        </li>
        <li>
          {{
            lang === "kz"
              ? `Қорғаныс реакциясынан аулақ болыңыз.Егер ата-аналар оқыту әдістеріне немесе, мысалы, үй тапсырмасының көлеміне қанағаттанбаса, нені басшылыққа алатыныңызды түсіндіріңіз (бағдарлама, әдістемелік ұсыныстар, ғылыми зерттеулер), бірақ ақтауға тырыспаңыз.`
              : `Избегайте защитной реакции.Если родителей не устраивает методика преподавания или, например, объём домашней работы, поясните, чем вы руководствуетесь (программа, методические рекомендации, научные исследования), но не пытайтесь оправдаться.`
          }}
        </li>
        <li>
          {{
            lang === "kz"
              ? `Позитивті көзқарасты сақтаңыз.Есіңізде болсын, кез келген қақтығысты екі тарап қаласа жеңуге болады.
                Ұстаздар мен ата-аналар өзара қалай қарым-қатынас орнатады?
                Оқу үшін тамаша жағдайды қалай жасауға болады?`
              : `Сохраняйте позитивный настрой.Помните, что любой конфликт можно преодолеть, если обе стороны этого хотят.`
          }}
        </li>
      </ul>
      <div class="toCenter">
        <div class="galleryContainer">
          <div class="gallerySolo">
            <img
              class="gallerySolo"
              src="@/assets/images/pages/psychologistImages/educators-and-parents.jpg"
              alt="finger-paintingTop"
            />
          </div>
        </div>
      </div>
    </div>
    <div class="bottomP"></div>
  </div>
</template>
