<script setup>
import link3 from "@/assets/images/pages/InclusionImages/Stars-of-Demeu.jpg";
defineProps({
  lang: String,
});
</script>

<template>
  <div class="backgroundFrame">
    <div class="page pageFour toCenter">
      <h1>
        {{
          lang === "kz"
            ? "«Звёзды Демеу» облыстық фестиваліне қатысу"
            : "Участие в областном фестивале «Звёзды Демеу»"
        }}
      </h1>
      <p>
        {{
          lang === "kz"
            ? `2024 жылдың мамыр айында ерекше білім беруді қажет ететін балалардың шығармашылық қабілеттерін қолдауға және дамытуға бағытталған жыл сайынғы облыстық «Звёзды Демеу» фестивалі өтті. Іс-шараның негізгі мақсаты оқушылардың шығармашылық әлеуетін ашуға жағдай жасау, сонымен қатар балалар арасында шығармашылық байланыстар мен достық қарым-қатынас орнату болды.`
            : `В мае 2024 года прошёл ежегодный областной фестиваль «Звёзды Демеу», направленный на поддержку и развитие творческих способностей детей с особыми образовательными потребностями. Основной целью мероприятия стало создание условий для раскрытия творческого потенциала учащихся, а также установление творческих связей и дружеского общения между детьми.`
        }}
      </p>
      <ul>
        <h3>
          {{
            lang === "kz"
              ? "Фестиваль келесі номинациялар бойынша өтті:"
              : "Фестиваль проводился по следующим номинациям:"
          }}
        </h3>
        <li>
          {{ lang === "kz" ? `бейнелеу өнері;` : `изобразительное творчество;` }}
        </li>
        <li>
          {{
            lang === "kz"
              ? `көркем сөз және жатқа оқу сайысы;`
              : `художественное слово и конкурс чтецов;`
          }}
        </li>
        <li>
          {{ lang === "kz" ? `шығармашылық байқау;` : `творческий конкурс;` }}
        </li>
        <li>
          {{
            lang === "kz"
              ? `хореографиялық өнер байқауы.`
              : `конкурс хореографического искусства.`
          }}
        </li>
      </ul>
      <p>
        {{
          lang === "kz"
            ? `«Ахмет Байтұрсынұлы атындағы №9 орта мектеп» КММ-ден фестивальдің түрлі бағыттары бойынша өздерін көрсете білген 19 оқушы лайықты өнер көрсетті. Барлық қатысушылар жүлделі орындарға ие болды, I дәрежелі лауреат атанды және дипломдармен, естелік сыйлықтармен марапатталды.`
            : `КГУ «Средняя школа №9 имени Ахмета Байтурсынулы» достойно представили 19 учеников, проявивших себя в различных направлениях фестиваля. Все участники заняли призовые места, стали лауреатами I степени и были награждены дипломами, памятными подарками и призами.`
        }}
      </p>
      <p>
        {{
          lang === "kz"
            ? `Бұл жетістік балаларға қолдау, өз күштеріне сенімділік пен үлкен шығармашылық алаңда өзін көрсету мүмкіндігін қамтамасыз еткен педагогтардың, инклюзияны қолдау кабинеті мамандарының және ата-аналардың бірлескен жұмысының нәтижесі болды.`
            : `Этот успех стал результатом совместной работы педагогов, специалистов кабинета поддержки инклюзии и родителей, обеспечивших детям поддержку, уверенность в своих силах и возможность проявить себя на большой творческой площадке.`
        }}
      </p>
      <div class="gallery">
        <img class="gallery-image" :src="link3" alt="methodImage" />
      </div>
    </div>
    <div class="bottomP"></div>
  </div>
</template>

<style scoped>
.gallery {
  grid-template-columns: repeat(1, minmax(50px, 1fr));
}
</style>
