<template>
  <h1>
    «Сабақта оқушылардың функционалдық сауаттылығын қалыптастыру» тақырыбындағы вебинар
  </h1>
  <p>
    <b>«Ахмет Байтұрсынұлы атындағы № 9 орта мектеп» КММ-де 2</b>
    025 жылғы 14 мамырда «943 — НЫСАНАЛЫ МЕКТЕПТЕРДІ ДАМЫТУ» РЕСПУБЛИКАЛЫҚ ЖОБАСЫНЫҢ
    «ҚАЛА-СЕЛУ» жобасын іске асыру шеңберінде «онлайн-вебинар» өткізілді. Тақырыбы:
  </p>

  <p>
    «Бастауыш сыныптарда және логопедиялық сабақтарда физика, биология, қазақ тілі, орыс
    тілі мен әдебиеті, шет тілі, математика сабақтарында оқушылардың функционалдық
    сауаттылығын қалыптастыру».
  </p>
</template>
