<script setup>
defineProps({
  lang: String,
});
</script>

<template>
  <div class="backgroundFrame">
    <div class="page pageFour">
      <div class="toCenter">
        <h1>
          {{
            lang === "kz"
              ? "Кәсіптік бағдар беру іс-шарасы"
              : "Профориентационное мероприятие"
          }}
        </h1>
        <br />
        <b>
          {{
            lang === "kz"
              ? `«Біздің мамандықтарымыз — біздің лайықты болашағымыз»`
              : ` «Наши профессии – Наше достойное будущее»`
          }}
        </b>
      </div>
      <p>
        {{
          lang === "kz"
            ? `2025 жылдың 23 сәуірінде «Жоғары құрылыс-экономикалық колледжі» КМҚК Жұмысшы мамандықтар жылы аясында «Біздің мамандықтарымыз – біздің лайықты болашағымыз» атты ашық есік күніне арналған кәсіптік бағдар беру іс-шарасы өтті.`
            : `23 апреля 2025 года в рамках Года рабочих профессий в КГКП «Высшем строительно-экономическом колледже» состоялось профориентационное мероприятие, посвященное Дню открытых дверей «Наши профессии – Наше достойное будущее».`
        }}
      </p>
      <p>
        {{
          lang === "kz"
            ? `Колледж оқытушылары оқушыларды қабылдау шарттарымен таныстырып, білім алушыларды даярлайтын мамандықтар мен сұранысқа ие кәсіптер туралы айтты. Оқушылар құрылыс жұмыстарын әрлеу бойынша шеберлік сабағына қатысу мүмкіндігіне ие болды. Сондай-ақ, олар 3D моделдеу кабинеті, геодезия кабинеті, гидравлика зертханасы, ағаш өңдеу, тас өңдеу және құрылыс-монтаждық жұмыстар бойынша шеберханалар сияқты арнайы кабинеттерді аралап көрді. Іс-шара аясында оқушылар мамандықтар мен өз болашағын таңдау мүмкіндіктері туралы біле алды.`
            : `Преподаватели колледжа ознакомили ребят с условиями поступления, рассказали о специальностях, востребованных профессиях, по которым готовят учащихся. Ребята смогли принять участие в мастер-классе по отделочным строительным работам. Также учащиеся посетили специализированные кабинеты такие как кабинет 3Д моделирования, кабинет геодезии, лаборатория гидравлики, мастерские столярных, каменных, отделочных работ. В рамках проведения мероприятия учащиеся смогли узнать о профессиях и возможностях выбора своего будущего.`
        }}
      </p>
      <div class="gallery galleryContainer">
        <img
          src="@/assets/images/pages/WhereToStudy/career-guidance-event.jpeg"
          alt="meeting-EDU-representative.jpeg"
          class="gallery-image"
        />
      </div>
    </div>
    <div class="bottomP"></div>
  </div>
</template>

<style scoped>
.gallery {
  grid-template-columns: repeat(1, minmax(50px, 1fr));
}

.gallery-image {
  max-height: 550px;
}
</style>
