<script setup>
defineProps({
  lang: String,
});
</script>

<template>
  <div class="backgroundFrame">
    <div class="page pageFour">
      <h1>
        {{
          lang === "kz"
            ? "«Искандер Даутов атындағы Петропавл қаласының қызмет көрсету саласы колледжінің» өкілімен кездесу"
            : "Встреча с представителем   КГУ «Колледж сферы обслуживания города Петропавловск имени Искандера Даутова»"
        }}
      </h1>
      <p>
        {{
          lang === "kz"
            ? `2025 жылғы 13 мамырда 9-сынып оқушыларымен «Искандер Даутов атындағы Петропавл қаласының қызмет көрсету саласы колледжі» КММ өкілі С.В.Прянниковамен кәсіби бағдар беру кездесуі өткізілді.`
            : `13 мая 2025 года с учащимися 9 классов была проведена профориентационная встреча с  представителем КГУ «Колледж сферы обслуживания города Петропавловск имени Искандера Даутова»`
        }}
      </p>
      <p>
        {{
          lang === "kz"
            ? `Оқушыларға колледж ұсынатын мамандықтар туралы ақпарат берілді, олар: наубайшы, модельер-пішуші, шаштараз-стилист, кондитер-дизайнер және аспаз. Кездесу соңында ақпараттық буклеттер таратылды.`
            : `Учащимcя была представлена информация о профессиях, которые предлагает колледж, таких как пекарь, модельер-закройщик, парикмахер-стилист, кондитер-оформитель и повар. В завершение были вручены информационные буклеты.`
        }}
      </p>
      <div class="gallery galleryContainer">
        <img src="@/assets/images/pages/WhereToStudy/meeting-EDU-representative.jpeg" alt="meeting-EDU-representative.jpeg" class="gallery-image"/>
      </div>
    </div>
    <div class="bottomP"></div>
  </div>
</template>

<style scoped>

.gallery {
  grid-template-columns: repeat(1, minmax(50px, 1fr));
}

.gallery-image {
  max-height: 550px;
}
</style>
