<script setup>
defineProps({
  lang: String,
});
</script>

<template>
  <div class="backgroundFrame">
    <div class="page pageFour">
      <div class="toCenter">
        <h1>
          {{
            lang === "kz"
              ? "Кәсіптік бағдар беру іс-шарасы"
              : "Профориентационное мероприятие"
          }}
        </h1>
        <br>
        <b>
          {{
            lang === "kz"
              ? `«Еңбек мобильділігі орталығы» КММ`
              : `КГУ «Центр трудовой мобильности»`
          }}
        </b>
      </div>
      <p>
        {{
          lang === "kz"
            ? `2025 жылдың 22 сәуірінде 11 сынып оқушылары үшін «СҚО жұмыспен қамтуды үйлестіру және әлеуметтік бағдарламалар басқармасы» КММ «Еңбек мобильділігі орталығы» КММ «Карьерлік орталық» филиалының өкілдерімен кездесу өткізілді.`
            : `22 апреля 2025 года для учащихся 11 классов была проведена встреча с представителями филиала «Карьерный центр» КГУ «Центр трудовой мобильности» КГУ «Управление координации занятости и социальных программ СКО».`
        }}
      </p>
      <p>
        {{
          lang === "kz"
            ? `Руководитель Адилова Т.В. в ходе встречи рассказала учащимся о
            том, что такое карьерный центр и какие услуги он предоставляет.Карьерный центр
            филиал центра трудовой мобильности, который предлагает различные программы и
            курсы. Учащимся была представлена информация о курсах «Skills enbek»,
            предназначенных как для начинающих, так и для практикующих специалистов.`
            : `Кездесу барысында жетекші Т.В. Адилова оқушыларға Карьерлік орталықтың қызметі
            және оның қандай мүмкіндіктер ұсынатыны туралы айтып берді. Карьерлік орталық –
            Еңбек мобильділігі орталығының филиалы болып табылады және түрлі бағдарламалар мен
            курстарды ұсынады. Оқушыларға жаңадан бастаушылар мен тәжірибелі мамандарға
            арналған «Skills enbek» курстары туралы ақпарат берілді.`
        }}
      </p>
      <div class="gallery galleryContainer">
        <img
          src="@/assets/images/pages/WhereToStudy/Meetup-Career-Center.jpeg"
          alt="meeting-EDU-representative.jpeg"
          class="gallery-image"
        />
      </div>
    </div>
    <div class="bottomP"></div>
  </div>
</template>

<style scoped>
.gallery {
  grid-template-columns: repeat(1, minmax(50px, 1fr));
}

.gallery-image {
  max-height: 550px;
}
</style>
