<script setup>
defineProps({
  lang: String,
});
</script>

<template>
  <div class="backgroundFrame">
    <div class="page pageFour">
      <div class="toCenter">
        <h1>
          {{
            lang === "kz"
              ? "«Мамандықтар лабиринті»"
              : "«Лабиринт профессий»"
          }}
        </h1>
      </div>
      <p>
        {{
          lang === "kz"
            ? `2025 жылдың 14 сәуірінде кәсіптік бағдар беру мұғалімі 7 сынып оқушыларымен «Мамандықтар лабиринті» атты іс-шара өткізді. Іс-шараның мақсаты – балалармен кәсіптік бағдар беру жұмысын насихаттау, сондай-ақ еңбекке және еңбек адамдарына құрметпен қарауға тәрбиелеу. Оқушыларға жұмысшы мамандықтары туралы ақпарат ұсынылды.`
            : `14 апреля 2025 года педагогом-профориентатором было проведено мероприятие «Лабиринт профессий» с учащимися 7 классов. Целью мероприятия является популяризация профориентационной работы с детьми, а также воспитание уважительного отношения к труду и людям труда. Учащимся была представлена информация о рабочих профессиях.`
        }}
      </p>
      <p>
        {{
          lang === "kz"
            ? `Сабақ барысында оқушылармен ППМАЖ (Психологиялық-педагогикалық мониторингтің автоматтандырылған жүйесі) бағдарламасы бойынша жұмыс жүргізілді.`
            : `В ходе занятия с учащимися проведена работа по программе АСППМ (Автоматизированная система психолого-педагогического мониторинга).`
        }}
      </p>
      <div class="gallery">
        <img
          src="@/assets/images/pages/WhereToStudy/professions.jpeg"
          alt="meeting-EDU-representative.jpeg"
          class="gallery-image"
        />
      </div>
    </div>
    <div class="bottomP"></div>
  </div>
</template>

<style scoped>
.pageFour {
  max-width: 700px;
}
.gallery {
  grid-template-columns: repeat(1, minmax(50px, 1fr));
}

.gallery-image {
  max-height: 550px;
}
</style>
